[FMXWeap_Pistol_9mm_Legacy]
ItemName="9mm Pistol"
ItemCategory="Hand Gun"
ItemDescription="•Fire mode is semi-auto only.\n•This is the standard 9mm pistol. Simple and cheap (very cheap, frankly, to you), it is the basic sidearm for all Horzine operatives."

[FMXWeap_AssaultRifle_M16M203_Legacy]
ItemName="M16 M203 Assault Rifle"
ItemCategory="Assault Rifle"
ItemDescription="•Firemode is full-auto only.\n•Alt-fire to fire grenades.\n•For those who can't decide between bullets and explosives."
SecondaryAmmo="M203 Grenade"

[FMXWeap_AssaultRifle_Medic_Legacy]
ItemName="HMTech-401 Assault Rifle"
ItemCategory="Assault Rifle"
ItemDescription="•Fire mode is full-auto only.\n•Alt-fire shoots healing darts to heal team members.\n•The full-blown assault rifle version of the HMTech pistol."

[FMXWeap_Beam_Microwave_Legacy]
ItemName="Microwave Gun"
ItemCategory="Flames"
ItemDescription="•Fire mode uses microwaves to heat Zeds at range, burning them inside and out.\n•Alt-fire unleashes a close-range microwave blast.\n•The wonders of modern technology: a handheld Zed-cooker."

[FMXWeap_Blunt_MaceAndShield_Legacy]
ItemName="Bone Crusher"
ItemCategory="Melee"
ItemDescription="•Primary - fast blunt attack; hold Primary for combo attack.\n•Secondary - heavy blunt attack that makes more use of the Shield.\n•Alt - block/parry. Blocking reduces damage from Zed projectiles.\n• Has a powerful Shield Bash attack."

[FMXWeap_Blunt_Pulverizer_Legacy]
ItemName="Pulverizer"
ItemCategory="Melee"
ItemDescription="•Primary - fast blunt attack; hold Primary for combo attack.\n•Secondary fires an explosive round on contact as well. When out of ammo, Secondary is a heavy blunt attack - so remember to reload!\n•Alt - block/parry."

[FMXWeap_Edged_Katana_Legacy]
ItemName="Katana"
ItemCategory="Melee"
ItemDescription="•Primary - fast slash attack; hold Primary for combo attack.\n•Secondary - heavy slash attack.\n•Alt - block/parry.\n•Try and show a little respect for its class."

[FMXWeap_Edged_Zweihander_Legacy]
ItemName="Zweihander"
ItemCategory="Melee"
ItemDescription="•Primary - medium/heavy damage, with some crowd control.\n•Secondary - slower, but with more damage.\n•Alt - block/parry\n•You do even more damage when moving forwards."
SharedUnlockSource="Chivalry Medieval Warfare"

[FMXWeap_Eviscerator_Legacy]
ItemName="Eviscerator"
ItemCategory="Special"
ItemDescription="•Primary fire shoots saw-blades.\n•Alt-fire is a melee attack, but uses fuel fast.\n•Originally designed by Horzine's SDS group in one of their wilder moments, this beast isn't subtle."
SecondaryAmmo="Gasoline"

[FMXWeap_Flame_Flamethrower_Legacy]
ItemName="Flamethrower"
ItemCategory="Flames"
ItemDescription="•Fire mode shoots flame. That's it.\n•A classic in any generation. If in doubt, simply burn everything down."

[FMXWeap_GrenadeLauncher_M79_Legacy]
ItemName="M79 Grenade Launcher"
ItemCategory="Explosives"
ItemDescription="•Fire mode launches a grenade.\n•Grenade explodes on impact.\n•Only arms itself a few meters downrange so you don't blow your own face off."

[FMXWeap_HuskCannon_Legacy]
ItemName="Husk Cannon"
ItemCategory="Flames"
ItemDescription="•Charges up while the fire button is pressed and discharges when the fire button is released. \n•The official Horzine version of the husk cannon. This model is 95% guaranteed not to explode."

[FMXWeap_Ice_FreezeThrower_Legacy]
ItemName="Freezethrower"
ItemCategory="Cryogenic"
ItemDescription="•Fire mode shoots a stream of absolute-zero particles.\n•Freeze everything! Biological matter can only withstand so much cold.\n•Freeze the ground to slow Zed movement."

[FMXWeap_LMG_Stoner63A_Legacy]
ItemName="Stoner 63A LMG"
ItemCategory="Light Machine Gun"
ItemDescription="•Fire mode is full-auto only.\n•A staple of U.S. Navy SEALs in the Vietnam War, the Stoner 63A has high ammo capacity and tons of stopping power."

[FMXWeap_Pistol_Dual9mm_Legacy]
ItemName="Dual 9mm Pistols"
ItemCategory="Hand Gun"
ItemDescription="•Fire mode is semi-auto only.\n•Alt-fire switches aiming styles when using iron sights.\n•This is a pair of standard 9mm pistols. You can sell one (only), if you need to."

[FMXWeap_Pistol_DualFlare_Legacy]
ItemName="Dual Spitfires"
ItemCategory="Flames"
ItemDescription="•Fire mode shoots exploding, flammable projectiles. \n•Alt-fire switches aiming styles when using iron sights.\n•This is a pair of Spitfires."

[FMXWeap_Pistol_Flare_Legacy]
ItemName="Spitfire"
ItemCategory="Flames"
ItemDescription="•Fire mode shoots exploding, flammable projectiles. \n•Fire delivery system in a more convenient, travel-sized package."

[FMXWeap_Rifle_CenterfireMB464_Legacy]
ItemName="SPX 464 Centerfire"
ItemCategory="Rifle"
ItemDescription="•Fire mode is single shot only.\n•A modern Mossberg centerfire lever-action rifle with low recoil and high stopping power. An updated classic."

[FMXWeap_Rifle_Hemogoblin_Legacy]
ItemName="Hemogoblin"
ItemCategory="Rifle"
ItemDescription="•Fire mode shoots a blood bore that injures, slows, and weakens Zeds. \n•Alt-fire shoots healing darts to heal team members.\n• Not a viable weight loss plan."

[FMXWeap_Rifle_M14EBR_Legacy]
ItemName="M14 EBR"
ItemCategory="Sniper Rifle"
ItemDescription="•Fire mode is single shot only.\n•Equipped with a laser sight.\n•The preferred sniper rifle of Navy SEALs, Delta Force, and other various badasses."

[FMXWeap_Rifle_RailGun_Legacy]
ItemName="Rail Gun"
ItemCategory="Sniper Rifle"
ItemDescription="•Fire mode is single shot only.\n•Using the sight lets you lock on to vulnerable spots on your target. \n•This weapon fires a solid steel slug at high speeds using magnets, penetrating Zeds like tissue paper."

[FMXWeap_Rifle_Winchester1894_Legacy]
ItemName="Winchester 1894"
ItemCategory="Rifle"
ItemDescription="•Fire mode is single shot only.\n•The classic Model 1894 Winchester lever-action rifle."

[FMXWeap_RocketLauncher_RPG7_Legacy]
ItemName="RPG-7"
ItemCategory="Explosives"
ItemDescription="•Fire mode launches the rocket.\n•Rocket explodes on impact.\n•Only arms itself a few meters downrange so you don't blow your own face off.\n•And watch the back-blast!"

[FMXWeap_RocketLauncher_Seeker6_Legacy]
ItemName="Seeker Six"
ItemCategory="Explosives"
ItemDescription="•Fire mode launches an unguided rocket.\n•Aiming in Alt-fire activates a targetting laser and enables guided rockets.\n•A versatile, high-explosive weapon that can track and engage multiple targets at once."

[FMXWeap_Shotgun_DoubleBarrel_Legacy]
ItemName="Double-barrel Boomstick"
ItemCategory="Shotgun"
ItemDescription="•Primary fire uses a single barrel only.\n•Alt-fire shoots both barrels at once.\n•Double-barrelled, side-by-side 12-gauge shotgun. Ideal for close-range combat. Even the biggest Zeds will stagger!"

[FMXWeap_Shotgun_DragonsBreath_Legacy]
ItemName="Dragonsbreath"
ItemCategory="Shotgun"
ItemDescription="•Fire mode is pump-action only.\n•A shotgun using Dragon's Breath Incendiary Rounds. Not only deadly, but looks wonderful too."

[FMXWeap_Shotgun_M4_Legacy]
ItemName="M4 Combat Shotgun"
ItemCategory="Shotgun"
ItemDescription="•Fire mode is semi-auto only.\n•Benelli designed the M4 Combat Shotgun for the US military. It is semi-automatic, allowing for a good, steady rate of fire."

[FMXWeap_Shotgun_Medic_Legacy]
ItemName="HMTech-301 Shotgun"
ItemCategory="Shotgun"
ItemDescription="•Fire mode is semi-auto only.\n•Alt-fire shoots healing darts to heal team members.\n•The combat shotgun version of the HMTech pistol."

[FMXWeap_Shotgun_Nailgun_Legacy]
ItemName="VLAD-1000 Nailgun"
ItemCategory="Shotgun"
ItemDescription="•Choice of single or multiple nail fire modes.\n•Alt-fire to toggle between fire modes.\n•We understand that one of the Horzine scientists borrowed the original nailgun from a (dead) maintenance man."

[FMXWeap_SMG_Mac10_Legacy]
ItemName="Mac 10"
ItemCategory="Sub Machine Gun"
ItemDescription="•Choice of full-auto and semi-auto fire modes.\n•Alt-fire to toggle between fire modes.\n•Features rapid-fire incendiary ammo. Get it? Rapid-fire? Because it's an incendiary submachinegun? Oh, forget it."

[FMXWeap_SMG_Medic_Legacy]
ItemName="HMTech-201 SMG"
ItemCategory="Submachine Gun"
ItemDescription="•Fire mode is full-auto only.\n•Alt-fire shoots healing darts to heal team members.\n•Your HMTech pistol, only beefed up!"

[FMXWeap_Thrown_C4_Legacy]
ItemName="C4 Explosives"
ItemCategory="Explosives"
ItemDescription="•Fire mode places your C4 charge.\n•Alt-fire detonates your C4 charges, in the sequence that you placed them.\n•A block of C4, wired for on-demand remote detonation."

[FMXWeap_Revolver_SW500_Legacy]
ItemName=".500 Magnum Revolver"
ItemCategory="Hand Gun"
ItemDescription="•Fire mode is single shot only.\n•True hand artillery in the form of a long-barrelled .50-caliber 'Bone Collector' revolver, firing full-load magnum rounds. For the serious Gunslinger."

[FMXWeap_Revolver_DualSW500_Legacy]
ItemName="Dual .500 Magnums"
ItemCategory="Hand Gun"
ItemDescription="•Fire mode is semi-auto only.\n•Alt-fire switches aiming styles when using iron sights.\n•A pair of .500 Magnum 'Bone Collector' revolvers."